app/controllers/movies_controller.rb

  def index
    sort = params[:sort]
    @sort = sort
    if (params[:sort])
      session[:sort] = sort
    end

    @filter_ratings = []
    @filter_ratings_hash = {}
    if (params[:ratings])# || session[:ratings])
       #if (!params[:ratings])
       #  params[:ratings] = session[:ratings]
       #end

       params[:ratings].each_key { |keyr|
         @filter_ratings.push(keyr)
         @filter_ratings_hash[keyr] = keyr
       }
       @movies = Movie.find(:all, :order=>sort, :conditions => {:rating => @filter_ratings})
       session[:ratings] = @filter_ratings_hash
    else
       if (session[:ratings])
         flash.keep
         redirect_to movies_path(:sort=>session[:sort], :ratings=>session[:ratings])
       end
       @movies = Movie.all(:order=>sort)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13') ORDER BY release_date
SELECT "movies".* FROM "movies" ORDER BY release_date